# PlaceCutinFittingFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..PlaceCutinFittingFailed Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Failed to insert part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PlaceCutinFittingFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlaceCutinFittingFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PlaceCutinFittingFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace